# 6. Сформировать (не программно) текстовый файл. В нём каждая строка должна описывать
# учебный предмет и наличие лекционных, практических и лабораторных занятий по предмету.
# Сюда должно входить и количество занятий. Необязательно, чтобы для каждого предмета
# были все типы занятий.
# Сформировать словарь, содержащий название предмета и общее количество занятий по
# нему. Вывести его на экран.
# Примеры строк файла: Информатика: 100(л) 50(пр) 20(лаб).
# Физика: 30(л) — 10(лаб)
# Физкультура: — 30(пр) —
# Пример словаря: {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}

res_dict = {}
with open("text_6.txt", "r", encoding="utf-8") as my_f:
    for st in my_f:
        name, study = st.replace("\n", "").split(":")
        res_dict[name] = sum(map(int, "".join([n for n in st if n == ' ' or '0' <= n <= '9']).split()))
print(res_dict)